OpenFOAM-13/tutorials/incompressibleFluid/simpleRushtonNCC/system/createZonesDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createZonesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

stirrer
{
    type        union;

    blades
    {
        type        surface;
        surface     triSurface;
        file        "stirrer4.obj";
    }

    disk
    {
        type        surface;
        surface     disk;
        origin      (0 0 0.6);
        normal      (0 0 1);
        radius      0.1125;
    }
}

baffles
{
    type        surface;
    surface     triSurface;
    file        "baffles.obj";
}

rotatingZone
{
    type        surface;
    surface     cylinder;
    point1      (0 0 0.54);
    point2      (0 0 0.66);
    radius      0.2;
}

rotatingCellZone
{
    type        cylinder;
    zoneType    cell;
    name        rotatingZone;

    point1      (0 0 0.54);
    point2      (0 0 0.66);
    radius      0.2;
}

// ************************************************************************* //
